{
  "nav-about": "परिचय",
  "nav-tech": "टेक्नोलॉजीज",
  "nav-project": "प्रोजेक्ट्स",
  "greeting": {
    "line1": "नमस्ते, मैं हूँ",
    "line2": "हर्ष सिद्धपुरिया",
    "line3": "मैं हूँ"
  },
  "job-greet": "मैं हूँ",

  "brief-about": "परिणाम-उन्मुख सॉफ्टवेयर डेवलपर, कंप्यूटर इंजीनियरिंग में पृष्ठभूमि के साथ, तकनीकी समस्याओं को हल करने, नई तकनीकों को सीखने और प्रभावी प्रोजेक्ट्स को लागू करने में अच्छी समझ रखने वाला, जो संगठन के उद्देश्यों के अनुरूप नवाचार समाधान में टीमवर्क बनाए।",
  "downloadCVBtn": "सीवी डाउनलोड करें",
  "about-title": "परिचय",
  "about": {
    "b1": "नमस्ते, मैं हर्ष सिद्धपुरिया हूँ, एक जुनूनी सॉफ्टवेयर डेवलपर, जिसकी कंप्यूटर इंजीनियरिंग में मजबूत पृष्ठभूमि है। मेरे पास C, C#, Python, JavaScript और RESTful API डेवलपमेंट के साथ फुल-स्टैक डेवलपमेंट का अनुभव है।",
    "b2": "मेरे प्रोजेक्ट्स में एक सहज कैंपस नेविगेशन सिस्टम और रियल-टाइम इमोशन डिटेक्शन शामिल हैं। ASP.NET Core, एडवांस्ड एल्गोरिदम्स और टीमवर्क की मदद से मैं परिणामों के प्रभाव और दक्षता की दिशा में कार्य करता हूँ।",
    "b3": "कोडिंग के अलावा, मुझे यात्रा करना, पढ़ना और नई तकनीकों को सीखना पसंद है ताकि मैं लगातार बदलती टेक्नोलॉजी दुनिया में आगे बना रहूं।",
    "b4": "— मेरा काम जरूर देखें और मुझसे जुड़ें!"
  },
  "technologies-known-title": "ज्ञात टेक्नोलॉजीज",
  "view-all-tech-btn": "सभी टेक्नोलॉजीज देखें",
  "projects-title": "प्रोजेक्ट्स",
  "add-details-title1": "मेरी अतिरिक्त",
  "add-details-title2": "जानकारी",
  "add-detail-breif": "मैं English, Hindi और Gujarati बोलता हूँ, जो मुझे विभिन्न लोगों से जुड़ने में मदद करता है। मुझे नई तकनीकों के बारे में सीखना, नई यात्राओं का अनुभव करना और पढ़ाई करना पसंद है ताकि ज्ञान बढ़ा सकूं। मेरी प्रभावी संवाद क्षमता, क्रिटिकल थिंकिंग और निर्णय लेने की क्षमता मुझे चुनौतियों का सामना करने और तेजी से अनुकूलन करने में मदद करती है।",
  "language-title": "भाषाएं",
  "language": ["English", "Hindi", "Gujarati"],
  "interest-title": "रुचियां",
  "interest": ["निरंतर सीखना", "यात्रा करना", "पुस्तक पढ़ना"],
  "softskill-title": "सॉफ्ट स्किल्स",
  "softskill": ["कम्युनिकेशन", "क्रिटिकल थिंकिंग", "निर्णय लेना"],
  "contact-title1": "संपर्क करें",
  "contact-title2": "मुझसे संपर्क करें",
  "contact": {
    "c1": "नाम",
    "c2": "ईमेल एड्रेस",
    "c3": "संदेश"
  },
  "send-btn": "भेजें",
  "contact-success-msg": "मुझसे संपर्क करने के लिए धन्यवाद। मैं जल्द ही आपसे संपर्क करूंगा।",
  "contact-error-msg": "कुछ गलत हो गया। कृपया बाद में पुनः प्रयास करें या ईमेल या LinkedIn के माध्यम से संपर्क करें।",
  "follow-me": "मुझे फॉलो करें",
  "footer-about-title": "मेरे बारे में",
  "footer-about": "जुनूनी डेवलपर जो क्रिएटिव वेब अनुभव बनाता है। आइए मिलकर कुछ बेहतरीन बनाते हैं!",
  "check-git": "Github पर देखें",
  "read-more-bnt": "और पढ़ें",
  "tech-used-title": "प्रयुक्त टेक्नोलॉजीज",
  "unsupport-vid-tag-warning": "आपका ब्राउज़र वीडियो टैग को सपोर्ट नहीं करता।",
  "visit-website": "वेबसाइट पर जाएं",
  "proj-images-title": "इमेजेस",
  "pd-proj-p1": "प्रोजेक्ट",
  "pd-proj-p2": "अतिरिक्त",
  "pd-proj-p3": "जानकारी",
  "thank-you": "धन्यवाद",

  "project-list": {
    "ProjectsList": [
      {
        "name": "पाथ प्रोवाइडर",
        "brief": "यह वेब एप्लिकेशन विश्वविद्यालय या किसी स्थान के आस-पास के स्थानों को दिखाता है। उपयोगकर्ता QR कोड स्कैन करके साइट एक्सेस कर सकते हैं, मैप देख सकते हैं और स्थान से जुड़ी जानकारी एक्सप्लोर कर सकते हैं।",
        "detail_decs": "यह प्रोजेक्ट एक वेब एप्लिकेशन है जो उपयोगकर्ताओं को किसी विशेष विश्वविद्यालय या किसी अन्य स्थान के आस-पास के सभी स्थानों का मैप प्रदान करता है। उपयोगकर्ता QR कोड स्कैन करके वेबसाइट पर जा सकते हैं जहां वे मैप और उस स्थान से जुड़ी अन्य जानकारी देख सकते हैं। यह एप्लिकेशन HTML, CSS, JavaScript और Python का उपयोग करके बनाया गया है। इंटरएक्टिव मैप्स बनाने के लिए Python में Folium लाइब्रेरी का उपयोग किया गया है।",
        "technology": ["HTML", "CSS", "JavaScript", "Python", "Folium"],
        "features": [
          "किसी स्थान के आस-पास के स्थानों के साथ डायनामिक मैप्स दिखाएं।",
          "स्थान और विश्वविद्यालयों को खोजें।",
          "इंटरएक्टिव और उपयोगकर्ता-मित्रवत इंटरफेस।",
          "रिस्पॉन्सिव डिज़ाइन।",
          "QR कोड स्कैन करके मैप पर जाएं।"
        ]
      },
      {
        "name": "जावास्क्रिप्ट प्रोजेक्ट्स",
        "brief": "जावास्क्रिप्ट मिनी-प्रोजेक्ट्स में छोटे-छोटे व्यावहारिक प्रोजेक्ट्स शामिल हैं, जैसे कि टिक टैक टो गेम जिसमें सिंगल प्लेयर (मिनिमैक्स एल्गोरिदम) और मल्टीप्लेयर फीचर है, टू-डू लिस्ट्स, रैंडम कलर जेनरेटर, टेक्स्ट कन्वर्टर, टेक्स्ट टू स्पीच कन्वर्टर, टेक्स्ट सर्चिंग और हाइलाइटिंग और वेदर फोरकास्ट। इससे मुझे कोर जावास्क्रिप्ट, DOM मैनिपुलेशन और APIs का अभ्यास करने में मदद मिली और उपयोगी, व्यावहारिक एप्लिकेशन बनाने में भी।",
        "detail_decs": "मैंने जावास्क्रिप्ट मिनी-प्रोजेक्ट्स का एक कलेक्शन तैयार किया है ताकि मैं कोर जावास्क्रिप्ट, DOM मैनिपुलेशन, एल्गोरिदम्स और API इंटीग्रेशन में अपनी स्किल्स को बेहतर बना सकूं। इस कलेक्शन में एक टिक-टैक-टो गेम शामिल है जिसमें सिंगल-प्लेयर मोड (जहां AI मिनिमैक्स एल्गोरिदम द्वारा संचालित है) और मल्टीप्लेयर मोड दोनों उपलब्ध हैं। इसके अलावा, मैंने एक टू-डू लिस्ट एप्लिकेशन भी बनाया है जिसमें उपयोगकर्ता टास्क जोड़ सकते हैं, संपादित कर सकते हैं, पूर्ण कर सकते हैं और हटा सकते हैं, और यह सब लोकल स्टोरेज में सेव होता है। एक और प्रोजेक्ट है रैंडम कलर जेनरेटर, जो रैंडम HEX और RGB कलर तुरंत जनरेट करता है, जो डिजाइनर्स और डेवलपर्स के लिए उपयोगी है। इसके अतिरिक्त, मैंने एक टेक्स्ट कन्वर्टर बनाया है, जो टेक्स्ट को अपरकेस, लोअरकेस या सेंटेंस केस में कन्वर्ट करने में मदद करता है, जिससे टेक्स्ट एडिटिंग आसान हो जाती है। मेरा टेक्स्ट-टू-स्पीच कन्वर्टर, Web Speech API का उपयोग करके लिखे गए टेक्स्ट को बोलने में बदलता है, जो एक्सेसिबिलिटी को बढ़ाता है। मैंने एक टेक्स्ट सर्चिंग और हाइलाइटिंग टूल भी बनाया है, जो उपयोगकर्ताओं को किसी पैराग्राफ में विशेष शब्द खोजने और उन्हें तुरंत हाइलाइट करने की सुविधा देता है। इन प्रोजेक्ट्स के माध्यम से, मैंने जावास्क्रिप्ट की बेसिक्स, DOM मैनिपुलेशन, इवेंट हैंडलिंग, असिंक्रोनस प्रोग्रामिंग, एल्गोरिदम इम्प्लीमेंटेशन, API इंटीग्रेशन और लोकल स्टोरेज का अच्छे से अभ्यास किया। इन प्रोजेक्ट्स ने मेरी जावास्क्रिप्ट स्किल्स को मजबूत करने के साथ-साथ मुझे व्यावहारिक और इंटरएक्टिव एप्लिकेशन बनाने का अनुभव भी दिया है जो रियल वर्ल्ड की समस्याओं को हल करते हैं।",
        "technology": ["JavaScript", "html", "css"],
        "features": [
          "टिक-टैक-टो (सिंगल और मल्टीप्लेयर): AI (मिनिमैक्स एल्गोरिदम) के खिलाफ खेलें या किसी दोस्त को चुनौती दें।",
          "टू-डू लिस्ट: टास्क जोड़ें, संपादित करें, पूर्ण करें और हटाएं, लोकलस्टोरेज में डेटा सेव के साथ।",
          "रैंडम कलर जेनरेटर: डिजाइन प्रेरणा के लिए तुरंत रैंडम HEX और RGB कलर जनरेट करें।",
          "टेक्स्ट कन्वर्टर: टेक्स्ट को अपरकेस, लोअरकेस, सेंटेंस केस आदि में कन्वर्ट करें और फॉर्मेटिंग आसान बनाएं।",
          "टेक्स्ट-टू-स्पीच कन्वर्टर: Web Speech API का उपयोग करके लिखे गए टेक्स्ट को स्पीच में बदलें।",
          "टेक्स्ट सर्चिंग और हाइलाइटिंग: किसी पैराग्राफ में शब्द या वाक्यांश खोजें और उन्हें डायनामिक रूप से हाइलाइट करें।"
        ]
      },
      {
        "name": "फेशियल एक्सप्रेशन डिटेक्शन",
        "brief": "फेस एक्सप्रेशन डिटेक्शन सिस्टम जो Python, OpenCV, Keras और TensorFlow का उपयोग करके बनाया गया है। यह सिस्टम रियल-टाइम में चेहरे के हाव-भाव (expressions) को डिटेक्ट और क्लासिफाई करने में सक्षम है।",
        "detail_decs": "मैंने Python, OpenCV, Keras और TensorFlow का उपयोग करके एक फेस एक्सप्रेशन डिटेक्शन सिस्टम विकसित किया है, जो रियल-टाइम में चेहरे के हाव-भाव को पहचानने और वर्गीकृत करने के लिए डिज़ाइन किया गया है। यह सिस्टम फेस डिटेक्शन के लिए OpenCV का उपयोग करता है, जबकि इमोशन पहचानने के लिए Keras और TensorFlow आधारित डीप लर्निंग मॉडल काम करता है, जो खुशी, उदासी, गुस्सा, आश्चर्य, न्यूट्रल और अन्य इमोशन्स को पहचान सकता है। मॉडल को फेस एक्सप्रेशंस के डेटा सेट पर ट्रेन किया गया है, जिससे यह रियल-वर्ल्ड सिचुएशन में उच्च सटीकता प्रदान करता है। यह सिस्टम वेबकैम से लाइव वीडियो फीड प्रोसेस करता है, चेहरों को डिटेक्ट करता है और तुरंत एक्सप्रेशन क्लासिफाई करता है, जिससे यह ह्यूमन-कंप्यूटर इंटरैक्शन, इमोशन एनालिसिस और सर्विलांस सिस्टम्स जैसे एप्लीकेशंस में उपयोगी बनता है। डीप लर्निंग और कंप्यूटर विज़न का उपयोग करके इस प्रोजेक्ट ने मेरी इमेज प्रोसेसिंग, न्यूरल नेटवर्क्स और रियल-टाइम AI एप्लिकेशंस में एक्सपर्टीज को बढ़ाया है।",
        "technology": ["python"],
        "features": [
          "रियल-टाइम फेस डिटेक्शन",
          "इमोशन क्लासिफिकेशन",
          "डीप लर्निंग मॉडल",
          "लाइव वेबकैम इंटीग्रेशन",
          "स्केलेबल और कस्टमाइज़ेबल",
          "संभावित उपयोग: ह्यूमन-कंप्यूटर इंटरैक्शन, इमोशन एनालिसिस और AI आधारित सर्विलांस में उपयोगी।"
        ]
      },
      {
        "name": "ऑथगार्ड कोर",
        "brief": "यह प्रोजेक्ट ASP.NET Core MVC में बिना ASP.NET Identity Framework या Entity Framework के ऑथेंटिकेशन और ऑथराइजेशन का डेमो है। इसका उद्देश्य यूज़र रोल्स, क्लेम्स और परमिशन्स को संभालने के लिए एक कस्टम इम्प्लीमेंटेशन प्रदान करना है।",
        "detail_decs": "यह प्रोजेक्ट ASP.NET Core MVC में एक कस्टम ऑथेंटिकेशन और ऑथराइजेशन सिस्टम को दर्शाता है, जो पूरी तरह से ASP.NET Identity Framework या Entity Framework के बिना बनाया गया है। बिल्ट-इन फ्रेमवर्क पर निर्भर होने के बजाय, यह एक हल्का और फ्लेक्सिबल यूज़र मैनेजमेंट सॉल्यूशन प्रदान करता है, जो कस्टम इम्प्लीमेंटेशन के माध्यम से यूज़र ऑथेंटिकेशन, रोल्स, क्लेम्स और परमिशन्स को हैंडल करता है। यह सिस्टम यूज़र्स के लॉगिन को सुरक्षित रूप से मैनेज करता है, स्पेसिफिक परमिशन्स वाले रोल्स असाइन करता है और मिडलवेयर-आधारित ऑथराइजेशन और क्लेम्स-बेस्ड आइडेंटिटी मैनेजमेंट का उपयोग करके एक्सेस कंट्रोल लागू करता है। यह सिक्योर पासवर्ड हैशिंग और साल्टिंग की सुविधा भी देता है, जो मजबूत ऑथेंटिकेशन सिक्योरिटी सुनिश्चित करता है। कस्टम डेटाबेस सॉल्यूशन को इंटीग्रेट करके, यह प्रोजेक्ट यूज़र डेटा को स्टोर और मैनेज करने पर पूरा कंट्रोल देता है, जिससे इसे विभिन्न आवश्यकताओं के अनुसार अनुकूलित किया जा सकता है।",
        "technology": ["Asp.net core MVC", "HTML", "CSS", "JavaScript"],
        "features": [
          "कस्टम ऑथेंटिकेशन सिस्टम",
          "रोल-बेस्ड एक्सेस कंट्रोल (RBAC)",
          "क्लेम्स-बेस्ड ऑथराइजेशन",
          "सिक्योर पासवर्ड स्टोरेज",
          "मिडलवेयर-ड्रिवन ऑथराइजेशन",
          "डेटाबेस फ्लेक्सिबिलिटी"
        ]
      },
      {
        "name": "क्रोम एक्सटेंशन",
        "brief": "एक Chrome एक्सटेंशन ब्राउज़र कार्यक्षमता का विस्तार है, जो HTML, CSS, और JavaScript जैसी वेब तकनीकों का उपयोग करता है। उदाहरण के लिए, एक Color Picker एक्सटेंशन यूज़र्स को वेब पेज से रंग चुनने की अनुमति देता है और उनके कोड्स जैसे HEX को दिखाता है, जिससे डिजाइन या डेवलपमेंट कार्यों में आसानी होती है।",
        "detail_decs": "मैंने एक Chrome Extension विकसित किया है जो HTML, CSS, और JavaScript का उपयोग करके ब्राउज़र की कार्यक्षमता को बढ़ाता है। इसका एक उदाहरण है Color Picker Extension, जो यूज़र्स को किसी भी वेब पेज से आसानी से रंग चुनने और तुरंत उनके HEX, RGB, या HSL कोड देखने की सुविधा देता है। यह टूल विशेष रूप से डिजाइनर्स, डेवलपर्स और कंटेंट क्रिएटर्स के लिए उपयोगी है, जिससे वे बिना किसी बाहरी सॉफ्टवेयर के रंगों को एक्सट्रैक्ट और उपयोग कर सकते हैं। यह एक्सटेंशन ब्राउज़र में आसानी से इंटीग्रेट हो जाता है और रंगों के कोड को चुनने और कॉपी करने के लिए एक सरल लेकिन शक्तिशाली UI प्रदान करता है। Chrome की Extension APIs का उपयोग करके यह वेब पेजेज के साथ स्मूद इंटरएक्शन सुनिश्चित करता है, जिससे कलर सिलेक्शन तेज़ और प्रभावी बनता है।",
        "technology": ["HTML", "CSS", "Javascript"],
        "features": [
          "आसान रंग चयन",
          "रंग कोड दिखाना",
          "स्मूद इंटीग्रेशन",
          "लाइटवेट और तेज़",
          "यूज़र-फ्रेंडली इंटरफेस",
          "डिजाइनर्स और डेवलपर्स के लिए उपयुक्त"
        ]
      }
    ]
  }
}
