{
  "nav-about": "ಬಗ್ಗೆ",
  "nav-tech": "ತಂತ್ರಜ್ಞಾನಗಳು",
  "nav-project": "ಪ್ರಾಜೆಕ್ಟ್‌ಗಳು",
  "greeting": {
    "line1": "ನಮಸ್ಕಾರ, ಇದು ನಾನು",
    "line2": "Harsh Sidhpuria",
    "line3": "ನಾನು"
  },
  "job-greet": "ನಾನು",

  "brief-about": "ಫಲಿತಾಂಶ ಪರಿಕಲ್ಪಿತ ಸಾಫ್ಟ್‌ವೇರ್ ಡೆವಲಪರ್ ಆಗಿದ್ದು, ಕಂಪ್ಯೂಟರ್ ಎಂಜಿನಿಯರಿಂಗ್ ಹಿನ್ನೆಲೆಯನ್ನು ಹೊಂದಿದ್ದು, ತಾಂತ್ರಿಕ ಸಮಸ್ಯೆಗಳನ್ನು ಪರಿಹರಿಸುವ ಉತ್ತಮ ಅರಿವು, ಹೊಸ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ಕಲಿಯುವ ಮತ್ತು ಪರಿಣಾಮಕಾರಿಯಾದ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳನ್ನು ಅಳವಡಿಸುವ ಮೂಲಕ ಸಂಸ್ಥೆಯ ಉದ್ದೇಶಗಳಿಗೆ ತಕ್ಕಂತೆ ಹೊಸ ಪರಿಹಾರಗಳನ್ನು ಒದಗಿಸಲು ತಂಡದ ಕೆಲಸವನ್ನು ಸೃಷ್ಟಿಸುವಲ್ಲಿ ಪರಿಣತಿ ಹೊಂದಿದ್ದೇನೆ.",
  "downloadCVBtn": "CV ಡೌನ್‌ಲೋಡ್ ಮಾಡಿ",
  "about-title": "ಬಗ್ಗೆ",
  "about": {
    "b1": "ಹಾಯ್, ನಾನು Harsh Sidhpuria, ಕಂಪ್ಯೂಟರ್ ಎಂಜಿನಿಯರಿಂಗ್ ಪೈಪೋಟಿಯನ್ನು ಹೊಂದಿರುವ ಉತ್ಸಾಹಿ ಸಾಫ್ಟ್‌ವೇರ್ ಡೆವಲಪರ್. ನಾನು C, C#, Python, JavaScript ಮತ್ತು RESTful API ಡೆವಲಪ್ಮೆಂಟ್‌ನೊಂದಿಗೆ ಫುಲ್-ಸ್ಟ್ಯಾಕ್ ಡೆವಲಪ್ಮೆಂಟ್ ಅನುಭವವನ್ನು ಹೊಂದಿದ್ದೇನೆ.",
    "b2": "ನನ್ನ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳಲ್ಲಿ ಅನುವುಕರವಾದ ಕ್ಯಾಂಪಸ್ ನ್ಯಾವಿಗೇಶನ್ ಸಿಸ್ಟಮ್ ಮತ್ತು ರಿಯಲ್ ಟೈಮ್ ಎಮೋಷನ್ ಡಿಟೆಕ್ಷನ್ ಸೇರಿವೆ. ASP.NET Core, ಸುಧಾರಿತ ಆಲ್ಗೋರಿದಮ್‌ಗಳು ಮತ್ತು ತಂಡದ ಸಹಕಾರದೊಂದಿಗೆ, ನಾನು ಪರಿಣಾಮ ಮತ್ತು ಕಾರ್ಯಕ್ಷಮತೆಯನ್ನು ಸಾಧಿಸುವತ್ತ ಕೆಲಸ ಮಾಡುತ್ತೇನೆ.",
    "b3": "ಕೋಡಿಂಗ್ ಹೊರತಾಗಿ, ನಾನು ಪ್ರವಾಸ, ಪುಸ್ತಕ ಓದು ಮತ್ತು ತಂತ್ರಜ್ಞಾನದ ನಿರಂತರ ಅಭಿವೃದ್ಧಿಯೊಂದಿಗೆ ಸದಾ ಮುಂಚೆ ಇರುವುದನ್ನು ಇಷ್ಟಪಡುತ್ತೇನೆ.",
    "b4": "— ನನ್ನ ಕೆಲಸವನ್ನು ಪರಿಶೀಲಿಸಿ ಮತ್ತು ನನ್ನೊಂದಿಗೆ ಸಂಪರ್ಕದಲ್ಲಿರಿ!"
  },
  "technologies-known-title": "ತಂತ್ರಜ್ಞಾನಗಳ ಅರಿವು",
  "view-all-tech-btn": "ಎಲ್ಲಾ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ನೋಡಿ",
  "projects-title": "ಪ್ರಾಜೆಕ್ಟ್‌ಗಳು",
  "add-details-title1": "ನನ್ನ ಹೆಚ್ಚುವರಿ",
  "add-details-title2": "ಮಾಹಿತಿ",
  "add-detail-breif": "ನಾನು ಇಂಗ್ಲಿಷ್, ಹಿಂದಿ ಮತ್ತು ಗುಜರಾತಿ ಮಾತನಾಡುತ್ತೇನೆ, ಇದು ನನಗೆ ವಿವಿಧ ಜನರೊಂದಿಗೆ ಸಂಪರ್ಕ ಸಾಧಿಸಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ. ನಾನು ಹೊಸ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ಕಲಿಯುವುದು, ಹೊಸ ಅನುಭವಗಳಿಗಾಗಿ ಪ್ರವಾಸ ಮಾಡುವುದು ಮತ್ತು ಜ್ಞಾನವನ್ನು ವಿಸ್ತರಿಸಲು ಪುಸ್ತಕಗಳನ್ನು ಓದುವು ಬಹಳ ಇಷ್ಟ. ಪರಿಣಾಮಕಾರಿಯಾದ ಸಂವಹನ, ವಿಮರ್ಶಾತ್ಮಕ ಚಿಂತನೆ ಮತ್ತು ನಿರ್ಧಾರ ಕೈಗೊಳ್ಳುವ ಕೌಶಲ್ಯಗಳು ನನಗೆ ಸವಾಲುಗಳನ್ನು ಎದುರಿಸಲು ಮತ್ತು ವೇಗವಾಗಿ ಹೊಂದಿಕೊಳ್ಳಲು ಸಹಾಯ ಮಾಡುತ್ತವೆ.",
  "language-title": "ಭಾಷಾ ಜ್ಞಾನ",
  "language": ["ಇಂಗ್ಲಿಷ್", "ಹಿಂದಿ", "ಗುಜರಾತಿ"],
  "interest-title": "ಆಸಕ್ತಿ",
  "interest": ["ನಿರಂತರ ಅಧ್ಯಯನ", "ಪ್ರವಾಸ", "ಪುಸ್ತಕ ಓದು"],
  "softskill-title": "ಮೃದು ಕೌಶಲ್ಯಗಳು",
  "softskill": ["ಸಂವಹನ", "ವಿಮರ್ಶಾತ್ಮಕ ಚಿಂತನೆ", "ನಿರ್ಧಾರ ತೆಗೆದುಕೊಳ್ಳುವುದು"],
  "contact-title1": "ಸಂಪರ್ಕಿಸಿ",
  "contact-title2": "ನನ್ನನ್ನು ಸಂಪರ್ಕಿಸಿ",
  "contact": {
    "c1": "ಹೆಸರು",
    "c2": "ಇಮೇಲ್ ವಿಳಾಸ",
    "c3": "ಸಂದೇಶ"
  },
  "send-btn": "ಕಳುಹಿಸಿ",
  "contact-success-msg": "ನನ್ನನ್ನು ಸಂಪರ್ಕಿಸಿದಕ್ಕಾಗಿ ಧನ್ಯವಾದಗಳು. ನಾನು ಸ್ವಲ್ಪ ಸಮಯದಲ್ಲಿ ನಿಮ್ಮನ್ನು ಸಂಪರ್ಕಿಸುತ್ತೇನೆ.",
  "contact-error-msg": "ಏನೋ ತಪ್ಪಾಗಿದೆ. ದಯವಿಟ್ಟು ಸ್ವಲ್ಪ ಹೊತ್ತಿನಲ್ಲಿ ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ ಅಥವಾ ಇಮೇಲ್ ಅಥವಾ ಲಿಂಕ್ಡ್‌ಇನ್ ಮೂಲಕ ಸಂಪರ್ಕಿಸಿ.",
  "follow-me": "ನನ್ನನ್ನು ಅನುಸರಿಸಿ",
  "footer-about-title": "ನನ್ನ ಬಗ್ಗೆ",
  "footer-about": "ಸೃಜನಾತ್ಮಕ ವೆಬ್ ಅನುಭವಗಳನ್ನು ನಿರ್ಮಿಸುವ ಉತ್ಸಾಹಿ ಡೆವಲಪರ್. ನಮ್ಮಿಬ್ಬರೂ ಸೇರಿ ಏನಾದರೂ ಅದ್ಭುತವಾದದನ್ನು ನಿರ್ಮಿಸೋಣ!",
  "check-git": "Github ನಲ್ಲಿ ಪರಿಶೀಲಿಸಿ",
  "read-more-bnt": "ಇನ್ನು ಹೆಚ್ಚು ಓದಿ",
  "tech-used-title": "ಬಳಸದ ತಂತ್ರಜ್ಞಾನಗಳು",
  "unsupport-vid-tag-warning": "ನಿಮ್ಮ ಬ್ರೌಸರ್ ವಿಡಿಯೋ ಟ್ಯಾಗ್ ಅನ್ನು ಬೆಂಬಲಿಸುವುದಿಲ್ಲ.",
  "visit-website": "ವೆಬ್‌ಸೈಟ್ ಭೇಟಿ ನೀಡಿ",
  "proj-images-title": "ಚಿತ್ರಗಳು",
  "pd-proj-p1": "ಪ್ರಾಜೆಕ್ಟ್",
  "pd-proj-p2": "ಹೆಚ್ಚುವರಿ",
  "pd-proj-p3": "ಮಾಹಿತಿ",
  "thank-you": "ಧನ್ಯವಾದಗಳು",
  "project-list": {
    "ProjectsList": [
      {
        "name": "ಪಾಥ್ ಪ್ರೊವೈಡರ್",
        "brief": "ಈ ವೆಬ್ ಅಪ್ಲಿಕೇಶನ್ ವಿಶ್ವವಿದ್ಯಾಲಯ ಅಥವಾ ಸ್ಥಳದ ಸುತ್ತಲಿನ ಸ್ಥಳಗಳನ್ನು ತೋರಿಸುತ್ತದೆ. ಬಳಕೆದಾರರು QR ಕೋಡ್ ಸ್ಕ್ಯಾನ್ ಮಾಡಿ ಸೈಟ್ ಪ್ರವೇಶಿಸಿ, ನಕ್ಷೆಗಳನ್ನು ವೀಕ್ಷಿಸಿ ಮತ್ತು ಸ್ಥಳದ ವಿವರಗಳನ್ನು ಅನ್ವೇಷಿಸಬಹುದು.",
        "detail_decs": "ಈ ಪ್ರಾಜೆಕ್ಟ್ ಒಂದು ವೆಬ್ ಅಪ್ಲಿಕೇಶನ್ ಆಗಿದ್ದು, ಇದು ಬಳಕೆದಾರರಿಗೆ ನಿರ್ದಿಷ್ಟ ವಿಶ್ವವಿದ್ಯಾಲಯ ಅಥವಾ ಬೇರೆ ಯಾವುದೇ ಸ್ಥಳದ ಸುತ್ತಲಿನ ಎಲ್ಲಾ ಸ್ಥಳಗಳನ್ನು ತೋರಿಸುವ ನಕ್ಷೆಯನ್ನು ಒದಗಿಸುತ್ತದೆ. ಬಳಕೆದಾರರು QR ಕೋಡ್ ಅನ್ನು ಸ್ಕ್ಯಾನ್ ಮಾಡುವ ಮೂಲಕ ವೆಬ್‌ಸೈಟ್‌ಗೆ ನಾವಿಗೇಟ್ ಮಾಡಬಹುದು ಮತ್ತು ಅಲ್ಲಿ ನಕ್ಷೆಗಳು ಹಾಗೂ ಸ್ಥಳದ ಇತರ ವಿವರಗಳನ್ನು ವೀಕ್ಷಿಸಬಹುದು. ಈ ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು HTML, CSS, JavaScript ಮತ್ತು Python ಬಳಸಿ ನಿರ್ಮಿಸಲಾಗಿದೆ. Python ನಲ್ಲಿ Folium ಲೈಬ್ರರಿಯನ್ನು ಇಂಟರಾಕ್ಟಿವ್ ನಕ್ಷೆಗಳನ್ನು ರಚಿಸಲು ಬಳಸಲಾಗಿದೆ.",
        "technology": ["HTML", "CSS", "JavaScript", "Python", "Folium"],
        "features": [
          "ನಿರ್ದಿಷ್ಟ ಸ್ಥಳದ ಸುತ್ತಲಿನ ಸ್ಥಳಗಳೊಂದಿಗೆ ಡೈನಾಮಿಕ್ ನಕ್ಷೆಗಳನ್ನು ಪ್ರದರ್ಶಿಸುತ್ತದೆ.",
          "ಸ್ಥಳಗಳು ಮತ್ತು ವಿಶ್ವವಿದ್ಯಾಲಯಗಳನ್ನು ಹುಡುಕು ಸಾಧ್ಯತೆ.",
          "ಇಂಟರಾಕ್ಟಿವ್ ಮತ್ತು ಬಳಕೆದಾರ ಸ್ನೇಹಿ ಇಂಟರ್ಫೇಸ್.",
          "ಪ್ರತ್ಯುತ್ತರಾತ್ಮಕ ವಿನ್ಯಾಸ (Responsive Design).",
          "QR ಕೋಡ್ ಸ್ಕ್ಯಾನ್ ಮಾಡುವ ಮೂಲಕ ನಕ್ಷೆಗೆ ನಾವಿಗೇಟ್ ಮಾಡಬಹುದು."
        ]
      },
      {
        "name": "ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳು",
        "brief": "ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್ ಮಿನಿ-ಪ್ರಾಜೆಕ್ಟ್‌ಗಳಲ್ಲಿ ಟಿಕ್ ಟಾಕ್ ಟೋ ಆಟ (ಸಿಂಗಲ್ ಪ್ಲೇಯರ್ (ಮಿನಿಮ್ಯಾಕ್ಸ್ ಅಲ್ಗೋರಿದಮ್) ಮತ್ತು ಮಲ್ಟಿಪ್ಲೇಯರ್ ಫೀಚರ್), ಟು-ಡೂ ಲಿಸ್ಟ್‌ಗಳು, ರ್ಯಾಂಡಮ್ ಕಲರ್ ಜನರೇಟರ್, ಟೆಕ್ಸ್ಟ್ ಕನವರ್್ಟರ್, ಟೆಕ್ಸ್ಟ್ ಟು ಸ್ಪೀಚ್ ಕನವರ್್ಟರ್, ಟೆಕ್ಸ್ಟ್ ಸರ್ಚಿಂಗ್ ಮತ್ತು ಹೈಲೈಟಿಂಗ್ ಹಾಗೂ ಹವಾಮಾನ ಮುನ್ಸೂಚನೆ ಯೋಜನೆಗಳನ್ನು ಒಳಗೊಂಡಿವೆ. ಇದು ನನಗೆ ಕೋರ್ ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್, DOM ಮ್ಯಾನಿಪುಲೇಶನ್ ಮತ್ತು API ಗಳನ್ನು ಅಭ್ಯಾಸ ಮಾಡುವಲ್ಲಿ ಸಹಾಯ ಮಾಡುತ್ತದೆ ಮತ್ತು ಉಪಯುಕ್ತ, ಪ್ರಾಯೋಗಿಕ ಅಪ್ಲಿಕೇಶನ್‌ಗಳನ್ನು ನಿರ್ಮಿಸಲು ಅನುಕೂಲವಾಗುತ್ತದೆ.",
        "detail_decs": "ನಾನು ಕೋರ್ ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್, DOM ಮ್ಯಾನಿಪುಲೇಶನ್, ಅಲ್ಗೋರಿದಮ್‌ಗಳು ಮತ್ತು API ಇಂಟಿಗ್ರೇಶನ್‌ನಲ್ಲಿ ನನ್ನ ಕೌಶಲ್ಯವನ್ನು ಹೆಚ್ಚಿಸಲು ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್ ಮಿನಿ-ಪ್ರಾಜೆಕ್ಟ್‌ಗಳ ಸಂಗ್ರಹವನ್ನು ನಿರ್ಮಿಸಿದ್ದೇನೆ. ಈ ಸಂಗ್ರಹದಲ್ಲಿ ಟಿಕ್-ಟಾಕ್-ಟೋ ಆಟವಿದ್ದು, ಇದರಲ್ಲಿ ಸಿಂಗಲ್ ಪ್ಲೇಯರ್ ಮೋಡ್‌ನಲ್ಲಿ ಮಿನಿಮ್ಯಾಕ್ಸ್ ಅಲ್ಗೋರಿದಮ್ ಮೂಲಕ AI ವಿರುದ್ಧ ಆಡಬಹುದು ಹಾಗೂ ಮಲ್ಟಿಪ್ಲೇಯರ್ ಮೋಡ್‌ನಲ್ಲಿ ಇಬ್ಬರು ಬಳಕೆದಾರರು ಆಟವಾಡಬಹುದು. ನಾನು ಟು-ಡೂ ಲಿಸ್ಟ್ ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಕೂಡ ನಿರ್ಮಿಸಿದ್ದೇನೆ, ಇದು ಬಳಕೆದಾರರಿಗೆ ಟಾಸ್ಕ್‌ಗಳನ್ನು ಸೇರಿಸಲು, ಸಂಪಾದಿಸಲು, ಪೂರ್ತಿಗೊಳಿಸಲು ಹಾಗೂ ಅಳಿಸಲು ಅವಕಾಶ ಮಾಡಿಕೊಡುತ್ತದೆ ಮತ್ತು localStorage ಉಪಯೋಗಿಸಿ ಡೇಟಾ ಸೇವ್ ಆಗುತ್ತದೆ. ಮತ್ತೊಂದು ಪ್ರಾಜೆಕ್ಟ್ ರ್ಯಾಂಡಮ್ ಕಲರ್ ಜನರೇಟರ್ ಆಗಿದ್ದು, ಇದು ಡಿಸೈನರ್‌ಗಳು ಮತ್ತು ಡೆವಲಪರ್‌ಗಳಿಗೆ ಉಪಯುಕ್ತವಾಗುವಂತೆ ಹೆಕ್ಸ್ ಮತ್ತು RGB ಮೌಲ್ಯಗಳೊಂದಿಗೆ ರ್ಯಾಂಡಮ್ ಕಲರ್‌ಗಳನ್ನು ತಕ್ಷಣ ಜನರೇಟ್ ಮಾಡುತ್ತದೆ. ಜೊತೆಗೆ ನಾನು ನಿರ್ಮಿಸಿದ ಟೆಕ್ಸ್ಟ್ ಕನವರ್್ಟರ್ ಬಳಕೆದಾರರಿಗೆ ಟೆಕ್ಸ್ಟ್ ಅನ್ನು uppercase, lowercase ಅಥವಾ ವಾಕ್ಯ ಕೇಸ್‌ಗೆ ಬದಲಾಯಿಸಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ, ಇದರಿಂದ ಟೆಕ್ಸ್ಟ್ ಎಡಿಟಿಂಗ್ ಸುಲಭವಾಗುತ್ತದೆ. ನನ್ನ ಟೆಕ್ಸ್ಟ್-ಟು-ಸ್ಪೀಚ್ ಕನವರ್್ಟರ್ ವೆಬ್ ಸ್ಪೀಚ್ API ಉಪಯೋಗಿಸಿ ಬರೆಯಲಾದ ಪದಗಳನ್ನು ಮಾತಾಗಿ ಪರಿವರ್ತಿಸುತ್ತದೆ, ಇದು ಆಕ್ಸೆಸಿಬಿಲಿಟಿಗೆ ಸಹಕಾರಿಯಾಗುತ್ತದೆ. ಅಲ್ಲದೆ, ನಾನು ನಿರ್ಮಿಸಿದ ಟೆಕ್ಸ್ಟ್ ಸರ್ಚಿಂಗ್ & ಹೈಲೈಟಿಂಗ್ ಟೂಲ್ ಬಳಕೆದಾರರಿಗೆ ಒಂದು ಪ್ಯಾರಾಗ್ರಾಫ್‌ನಲ್ಲಿ ನಿರ್ದಿಷ್ಟ ಪದಗಳನ್ನು ಹುಡುಕಲು ಮತ್ತು ತಕ್ಷಣ ಹೈಲೈಟ್ ಮಾಡಲು ಅನುಮತಿಸುತ್ತದೆ. ಈ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳ ಮೂಲಕ ನಾನು ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್ ಫಂಡಮೆಂಟಲ್ಸ್, DOM ಮ್ಯಾನಿಪುಲೇಶನ್, ಈವೆಂಟ್ ಹ್ಯಾಂಡ್ಲಿಂಗ್, ಅಸಿಂಕ್ರೊನಸ್ ಪ್ರೋಗ್ರಾಮಿಂಗ್, ಅಲ್ಗೋರಿದಮ್ ಇಂಪ್ಲಿಮೆಂಟೇಶನ್, API ಇಂಟಿಗ್ರೇಶನ್ ಮತ್ತು localStorage ಮೂಲಕ ಡೇಟಾ ಪರ್ಸಿಸ್ಟೆನ್ಸ್ ಅನ್ನು ಅಭ್ಯಾಸ ಮಾಡಿದ್ದೇನೆ. ಈ ಪ್ರಾಜೆಕ್ಟ್‌ಗಳು ನನಗೆ ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್ ಪರಿಣತಿಯನ್ನು ಬಲಪಡಿಸಲು ಮಾತ್ರವಲ್ಲದೆ ಪ್ರಾಯೋಗಿಕ, ಇಂಟರಾಕ್ಟಿವ್ ಅಪ್ಲಿಕೇಶನ್‌ಗಳನ್ನು ನಿರ್ಮಿಸಲು ಅನುಭವವನ್ನು ನೀಡಿವೆ.",
        "technology": ["JavaScript", "html", "css"],
        "features": [
          "ಟಿಕ್-ಟಾಕ್-ಟೋ (ಸಿಂಗಲ್ & ಮಲ್ಟಿಪ್ಲೇಯರ್): AI (ಮಿನಿಮ್ಯಾಕ್ಸ್ ಅಲ್ಗೋರಿದಮ್) ವಿರುದ್ಧ ಅಥವಾ ಸ್ನೇಹಿತನೊಂದಿಗೆ ಆಟವಾಡಿ.",
          "ಟು-ಡೂ ಲಿಸ್ಟ್: ಟಾಸ್ಕ್‌ಗಳನ್ನು ಸೇರಿಸಿ, ಸಂಪಾದಿಸಿ, ಪೂರ್ತಿಗೊಳಿಸಿ ಮತ್ತು ಅಳಿಸಿ. localStorage ಮೂಲಕ ಡೇಟಾ ಉಳಿಸಿ.",
          "ರ್ಯಾಂಡಮ್ ಕಲರ್ ಜನರೇಟರ್: ಡಿಸೈನ್ ಸ್ಪೂರ್ತಿಗಾಗಿ ತಕ್ಷಣ ರ್ಯಾಂಡಮ್ HEX ಮತ್ತು RGB ಕಲರ್‌ಗಳನ್ನು ಜನರೇಟ್ ಮಾಡಿ.",
          "ಟೆಕ್ಸ್ಟ್ ಕನವರ್್ಟರ್: ಸುಲಭ ಫಾರ್ಮ್ಯಾಟಿಂಗ್‌ಗಾಗಿ ಟೆಕ್ಸ್ಟ್ ಅನ್ನು uppercase, lowercase, sentence case ಮತ್ತು ಇನ್ನಿತರ ಫಾರ್ಮ್ಯಾಟ್‌ಗಳಿಗೆ ಪರಿವರ್ತಿಸಿ.",
          "ಟೆಕ್ಸ್ಟ್-ಟು-ಸ್ಪೀಚ್ ಕನವರ್್ಟರ್: ವೆಬ್ ಸ್ಪೀಚ್ API ಬಳಸಿ ಬರೆಯಲಾದ ಪದಗಳನ್ನು ಮಾತಾಗಿ ಪರಿವರ್ತಿಸುತ್ತದೆ.",
          "ಟೆಕ್ಸ್ಟ್ ಸರ್ಚಿಂಗ್ & ಹೈಲೈಟಿಂಗ್: ಪ್ಯಾರಾಗ್ರಾಫ್‌ನಲ್ಲಿ ಪದಗಳನ್ನು ಹುಡುಕಿ ಮತ್ತು ತಕ್ಷಣ ಹೈಲೈಟ್ ಮಾಡಿ."
        ]
      },
      {
        "name": "ಮುಖಭಾವ ಪತ್ತೆಹಚ್ಚುವಿಕೆ",
        "brief": "Python, OpenCV, Keras, ಮತ್ತು TensorFlow ಬಳಸಿದ ಮುಖಭಾವ ಪತ್ತೆಹಚ್ಚುವಿಕೆ ವ್ಯವಸ್ಥೆ. ಈ ವ್ಯವಸ್ಥೆ ನೈಜ ಸಮಯದಲ್ಲಿ ಮುಖಭಾವಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಿ ವರ್ಗೀಕರಿಸಲು ಸಾಮರ್ಥ್ಯ ಹೊಂದಿದೆ.",
        "detail_decs": "Python, OpenCV, Keras, ಮತ್ತು TensorFlow ಬಳಸಿಕೊಂಡು ನಾನು ಮುಖಭಾವ ಪತ್ತೆಹಚ್ಚುವಿಕೆ ವ್ಯವಸ್ಥೆಯನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಿದ್ದೇನೆ, ಇದು ನೈಜ ಸಮಯದಲ್ಲಿ ಮುಖಭಾವಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಿ ವರ್ಗೀಕರಿಸಲು ವಿನ್ಯಾಸಗೊಳಿಸಲಾಗಿದೆ. ಈ ವ್ಯವಸ್ಥೆಯಲ್ಲಿ OpenCV ಮುಖ ಪತ್ತೆಹಚ್ಚಲು ಬಳಸಲಾಗುತ್ತದೆ ಮತ್ತು Keras ಮತ್ತು TensorFlow ಆಧಾರಿತ ಡೀಪ್ ಲರ್ನಿಂಗ್ ಮಾದರಿ ಖುಷಿ, ದುಃಖ, ಕೋಪ, ಆಶ್ಚರ್ಯ, ಸಾಮಾನ್ಯ ಮತ್ತು ಇನ್ನಿತರ ಭಾವನೆಗಳನ್ನು ಗುರುತಿಸುತ್ತದೆ. ಮುಖಭಾವಗಳ ಡೇಟಾ ಸೆಟ್ ಮೇಲೆ ತರಬೇತಿ ನೀಡಿರುವುದರಿಂದ ಈ ಮಾದರಿ ನೈಜ ಪರಿಸ್ಥಿತಿಗಳಲ್ಲಿ ಹೆಚ್ಚು ನಿಖರವಾಗಿದೆ. ಈ ವ್ಯವಸ್ಥೆ ವೆಬ್ಕ್ಯಾಮ್‌ನಿಂದ ಲೈವ್ ವಿಡಿಯೋ ಫೀಡ್ ಅನ್ನು ಪ್ರಕ್ರಿಯೆಗೊಳಿಸಿ, ಮುಖಗಳನ್ನು ಪತ್ತೆಹಚ್ಚಿ ಮತ್ತು ತಕ್ಷಣ ಮುಖಭಾವವನ್ನು ವರ್ಗೀಕರಿಸುತ್ತದೆ, ಇದು ಮಾನವ-ಕಂಪ್ಯೂಟರ್ ಸಂವಹನ, ಭಾವನಾ ವಿಶ್ಲೇಷಣೆ ಮತ್ತು ಸುಧಾರಿತ ನಿಗಾವ್ಯವಸ್ಥೆಗಳಲ್ಲಿ ಉಪಯುಕ್ತವಾಗಿದೆ. ಡೀಪ್ ಲರ್ನಿಂಗ್ ಮತ್ತು ಕಂಪ್ಯೂಟರ್ ವಿಸನ್ ಬಳಸುವುದರ ಮೂಲಕ, ಈ ಯೋಜನೆ ನನ್ನ ಇಮೇಜ್ ಪ್ರೊಸೆಸಿಂಗ್, ನ್ಯೂರಲ್ ನೆಟ್‌ವರ್ಕ್ ಮತ್ತು ನೈಜ ಸಮಯ AI ಅಪ್ಲಿಕೇಶನ್‌ಗಳಲ್ಲಿ ಪರಿಣತಿಯನ್ನು ಹೆಚ್ಚಿಸಿದೆ.",
        "technology": ["python"],
        "features": [
          "ನೈಜ ಸಮಯದ ಮುಖ ಪತ್ತೆಹಚ್ಚುವಿಕೆ",
          "ಭಾವನಾ ವರ್ಗೀಕರಣ",
          "ಡೀಪ್ ಲರ್ನಿಂಗ್ ಮಾದರಿ",
          "ಲೈವ್ ವೆಬ್ಕ್ಯಾಮ್ ಇಂಟಿಗ್ರೇಶನ್",
          "ಸ್ಕೇಲಬಲ್ & ಕಸ್ಟಮೈಜ್ ಮಾಡಬಹುದಾದ ವ್ಯವಸ್ಥೆ",
          "ಅನ್ವಯಿಕೆಗಳು: ಮಾನವ-ಕಂಪ್ಯೂಟರ್ ಸಂವಹನ, ಭಾವನಾ ವಿಶ್ಲೇಷಣೆ ಮತ್ತು AI ಆಧಾರಿತ ನಿಗಾವ್ಯವಸ್ಥೆಗಳಿಗೆ ಉಪಯುಕ್ತ"
        ]
      },
      {
        "name": "ಆಥ್‌ಗಾರ್ಡ್ ಕೋರ್",
        "brief": "ಈ ಯೋಜನೆಯು ASP.NET Core MVC ಯಲ್ಲಿ ASP.NET ಐಡೆಂಟಿಟಿ ಫ್ರೇಮ್‌ವರ್ಕ್ ಅಥವಾ ಎಂಟಿಟಿ ಫ್ರೇಮ್‌ವರ್ಕ್ ಬಳಸದೇ ದೃಢೀಕರಣ ಮತ್ತು ಪ್ರಾಧಿಕಾರವನ್ನು ಪ್ರದರ್ಶಿಸುವ ಉದಾಹರಣೆ. ಬಳಕೆದಾರರ ಪಾತ್ರಗಳು, ಕ್ಲೈಮ್ಗಳು ಮತ್ತು ಅನುಮತಿಗಳನ್ನು ನಿರ್ವಹಿಸಲು ಕಸ್ಟಮ್ ಅನುಷ್ಟಾನವನ್ನು ಒದಗಿಸುವುದು ಈ ಯೋಜನೆಯ ಉದ್ದೇಶವಾಗಿದೆ.",
        "detail_decs": "ಈ ಯೋಜನೆಯು ASP.NET Identity Framework ಅಥವಾ Entity Framework ಅನ್ನು ಬಳಸದೇ ನಿರ್ಮಿತವಾದ ASP.NET Core MVC ಯಲ್ಲಿನ ಕಸ್ಟಮ್ ದೃಢೀಕರಣ ಮತ್ತು ಪ್ರಾಧಿಕಾರದ ವ್ಯವಸ್ಥೆಯನ್ನು ತೋರಿಸುತ್ತದೆ. ಬಿಲ್ಟ್-ಇನ್ ಫ್ರೇಮ್‌ವರ್ಕ್‌ಗಳನ್ನು ಅವಲಂಬಿಸದೆ, ಇದು ತೂಕಕಮ್ಮಿ ಮತ್ತು ಬದಲಾಯಿಸಬಹುದಾದ ಬಳಕೆದಾರ ನಿರ್ವಹಣಾ ಪರಿಹಾರವನ್ನು ಒದಗಿಸುತ್ತದೆ, ಅದು ಬಳಕೆದಾರ ದೃಢೀಕರಣ, ಪಾತ್ರಗಳು, ಕ್ಲೈಮ್ಗಳು ಮತ್ತು ಅನುಮತಿಗಳನ್ನು ಕಸ್ಟಮ್ ರೀತಿಯಲ್ಲಿ ನಿರ್ವಹಿಸುತ್ತದೆ. ಈ ವ್ಯವಸ್ಥೆ ಸುರಕ್ಷಿತವಾಗಿ ಬಳಕೆದಾರ ಲಾಗಿನ್‌ಗಳನ್ನು ನಿರ್ವಹಿಸುತ್ತದೆ, ನಿರ್ದಿಷ್ಟ ಅನುಮತಿಗಳೊಂದಿಗೆ ಪಾತ್ರಗಳನ್ನು ನಿಯೋಜಿಸುತ್ತದೆ ಮತ್ತು middleware ಆಧಾರಿತ ಪ್ರಾಧಿಕಾರ ಮತ್ತು ಕ್ಲೈಮ್ ಆಧಾರಿತ ಐಡೆಂಟಿಟಿ ನಿರ್ವಹಣೆಯ ಮೂಲಕ ಪ್ರವೇಶ ನಿಯಂತ್ರಣವನ್ನು ಜಾರಿಗೆ ತರುತ್ತದೆ. ಇದು ಸುರಕ್ಷಿತ ಪಾಸ್ವರ್ಡ್ ಹ್ಯಾಶಿಂಗ್ ಮತ್ತು ಸಾಲ್ಟಿಂಗ್ ಅನ್ನು ಒಳಗೊಂಡಿದ್ದು, ದೃಢೀಕರಣದ ಭದ್ರತೆಯನ್ನು ಖಚಿತಪಡಿಸುತ್ತದೆ. ಕಸ್ಟಮ್ ಡೇಟಾಬೇಸ್ ಪರಿಹಾರವನ್ನು ಸಮಾವೇಶಿಸುವ ಮೂಲಕ, ಈ ಯೋಜನೆ ಬಳಕೆದಾರರ ಡೇಟಾವನ್ನು ಹೇಗೆ ಸಂಗ್ರಹಿಸಬೇಕು ಮತ್ತು ನಿರ್ವಹಿಸಬೇಕು ಎಂಬುದರಲ್ಲಿ ಸಂಪೂರ್ಣ ನಿಯಂತ್ರಣವನ್ನು ಒದಗಿಸುತ್ತದೆ ಮತ್ತು ವಿಭಿನ್ನ ಅಗತ್ಯಗಳಿಗೆ ಹೊಂದಿಕೊಳ್ಳುವಂತಾಗುತ್ತದೆ.",
        "technology": ["Asp.net core MVC", "HTML", "CSS", "JavaScript"],
        "features": [
          "ಕಸ್ಟಮ್ ದೃಢೀಕರಣ ವ್ಯವಸ್ಥೆ",
          "ಪಾತ್ರ ಆಧಾರಿತ ಪ್ರವೇಶ ನಿಯಂತ್ರಣ (RBAC)",
          "ಕ್ಲೈಮ್ ಆಧಾರಿತ ಪ್ರಾಧಿಕಾರ",
          "ಸುರಕ್ಷಿತ ಪಾಸ್ವರ್ಡ್ ಸಂಗ್ರಹಣೆ",
          "ಮಿಡ್ಲ್ವೇರ್ ಆಧಾರಿತ ಪ್ರಾಧಿಕಾರ",
          "ಡೇಟಾಬೇಸ್ ಲವಚಿಕತೆ"
        ]
      },
      {
        "name": "ಕ್ರೋಮ್ ಎಕ್ಸ್‌ಟೆನ್ಷನ್",
        "brief": "ಕ್ರೋಮ್ ಎಕ್ಸ್‌ಟೆನ್ಷನ್ ಎನ್ನುವುದು ಬ್ರೌಸರ್ ಕಾರ್ಯಕ್ಷಮತೆಯ ವಿಸ್ತರಣೆ ಆಗಿದ್ದು, HTML, CSS, ಮತ್ತು ಜಾವಾಸ್ಕ್ರಿಪ್ಟ್ ನಂತಹ ವೆಬ್ ತಂತ್ರಜ್ಞಾನಗಳನ್ನು ಬಳಸುತ್ತದೆ. ಉದಾಹರಣೆಗೆ, ಕಲರ್ ಪಿಕರ್ ಎಕ್ಸ್‌ಟೆನ್ಷನ್ ಬಳಕೆದಾರರಿಗೆ ವೆಬ್ ಪುಟಗಳಿಂದ ಬಣ್ಣಗಳನ್ನು ಆರಿಸಲು ಅವಕಾಶ ನೀಡುತ್ತದೆ, ಮತ್ತು ಅವುಗಳ ಕೋಡ್ಗಳನ್ನು, ಉದಾಹರಣೆಗೆ HEX ಅನ್ನು ತೋರಿಸುತ್ತದೆ, ಇದು ವಿನ್ಯಾಸ ಅಥವಾ ಅಭಿವೃದ್ಧಿ ಕಾರ್ಯಗಳಲ್ಲಿ ಸುಲಭವಾಗಿ ಬಳಸಲು ಸಹಾಯಕವಾಗುತ್ತದೆ.",
        "detail_decs": "ನಾನು HTML, CSS, ಮತ್ತು JavaScript ಬಳಸಿ ಬ್ರೌಸರ್ ಕಾರ್ಯಕ್ಷಮತೆಯನ್ನು ಹೆಚ್ಚಿಸುವ Chrome Extension ಅನ್ನು ಅಭಿವೃದ್ಧಿಪಡಿಸಿದ್ದೇನೆ. ಒಂದು ಉದಾಹರಣೆ ಎಂದರೆ Color Picker Extension, ಇದು ಬಳಕೆದಾರರಿಗೆ ಯಾವುದೇ ವೆಬ್ ಪುಟದಿಂದ ಬಣ್ಣಗಳನ್ನು ಸುಲಭವಾಗಿ ಆಯ್ಕೆ ಮಾಡಬಹುದು ಮತ್ತು ತಕ್ಷಣವೇ ಅವರ HEX, RGB ಅಥವಾ HSL ಕೋಡ್ಗಳನ್ನು ವೀಕ್ಷಿಸಬಹುದು. ಈ ಉಪಕರಣವು ವಿನ್ಯಾಸಕಾರರು, ಡೆವಲಪರ್‌ಗಳು ಮತ್ತು ವಿಷಯ ಸೃಜನಕಾರರು ಉಪಯುಕ್ತವಾಗಿದ್ದು, ಬಾಹ್ಯ ಸಾಫ್ಟ್‌ವೇರ್ ಅಗತ್ಯವಿಲ್ಲದೆ ಬಣ್ಣಗಳನ್ನು ಪಡೆಯಲು ಮತ್ತು ಬಳಸಲು ಸಹಾಯ ಮಾಡುತ್ತದೆ. ಈ ಎಕ್ಸ್‌ಟೆನ್ಷನ್ ಬ್ರೌಸರ್‌ಗೆ ನಿರ್ವಿಘ್ನವಾಗಿ ಏಕೀಕರಿಸಿಕೊಂಡಿದ್ದು, ಬಣ್ಣ ಕೋಡ್‌ಗಳನ್ನು ಆಯ್ಕೆ ಮಾಡುವುದು ಮತ್ತು ನಕಲಿಸುವುದು ಸುಲಭವಾಗುವಂತೆ ಸರಳವಾದ ಆದರೆ ಶಕ್ತಿಶಾಲಿಯಾದ UI ಅನ್ನು ಒದಗಿಸುತ್ತದೆ. Chrome ನ ಎಕ್ಸ್‌ಟೆನ್ಷನ್ API ಗಳನ್ನು ಬಳಸುವುದರಿಂದ, ಇದು ವೆಬ್ ಪುಟಗಳೊಂದಿಗೆ ನಯವಾದ ಸಂವಹನವನ್ನು ಖಚಿತಪಡಿಸುತ್ತದೆ ಮತ್ತು ಬಣ್ಣ ಆಯ್ಕೆ ಪ್ರಕ್ರಿಯೆಯನ್ನು ವೇಗವಾದ ಮತ್ತು ಪರಿಣಾಮಕಾರಿಯಾಗಿ ಮಾಡುತ್ತದೆ.",
        "technology": ["HTML", "CSS", "Javascript"],
        "features": [
          "ಸುಲಭ ಬಣ್ಣ ಆಯ್ಕೆ",
          "ಬಣ್ಣ ಕೋಡ್‌ಗಳನ್ನು ತೋರಿಸುತ್ತದೆ",
          "ನಿರ್ವಿಘ್ನ ಏಕೀಕರಣ",
          "ತೂಕಕಮ್ಮಿ ಮತ್ತು ವೇಗವಾದದು",
          "ಬಳಕೆದಾರ ಸ್ನೇಹಿ ಇಂಟರ್ಫೇಸ್",
          "ಡಿಸೈನರ್‌ಗಳು ಮತ್ತು ಡೆವಲಪರ್‌ಗಳಿಗೆ ಆದರ್ಶ"
        ]
      }
    ]
  }
}
