{
  "nav-about": "વિશે",
  "nav-tech": "ટેકનોલોજી",
  "nav-project": "પ્રોજેક્ટ્સ",
  "greeting": {
    "line1": "હેલો, હું છું",
    "line2": "હર્ષ સિદ્ધપુરિયા",
    "line3": "હું"
  },
  "brief-about": "પરિણામ-લક્ષી સોફ્ટવેર ડેવલપર, જે કોમ્પ્યુટર એન્જિનિયરિંગ પૃષ્ઠભૂમિ ધરાવે છે, ટેક્નિકલ સમસ્યાઓ હલ કરવા, નવી ટેક્નોલોજી શીખવા અને સંસ્થાના ઉદ્દેશોને અનુરૂપ નવીન ઉકેલોમાં ટીમવર્ક બનાવવા માટે અસરકારક પ્રોજેક્ટ્સ અમલમાં મૂકવાની ક્ષમતા ધરાવે છે.",
  "job-greet": "હું છું",

  "downloadCVBtn": "CV ડાઉનલોડ કરો",
  "about-title": "વિશે",
  "about": {
    "b1": "હાય, હું હર્ષ સિદ્ધપુરિયા છું, એક ઉત્સાહી સોફ્ટવેર ડેવલપર જેનો મજબૂત કમ્પ્યુટર ઇજનેરીનો પૃષ્ઠભૂમિ છે. મને C, C#, Python, JavaScript અને RESTful API ડેવલપમેન્ટ સાથે ફુલ-સ્ટેક ડેવલપમેન્ટનો અનુભવ છે.",
    "b2": "મારા પ્રોજેક્ટ્સમાં એક સરળ કેમ્પસ નેવિગેશન સિસ્ટમ અને રિયલ-ટાઈમ ઇમોશન ડિટેક્શન સામેલ છે. ASP.NET Core, એડવાન્સ્ડ એલ્ગોરિધમ્સ અને ટીમવર્કના માધ્યમથી હું હંમેશાં અસરકારક અને કાર્યક્ષમ પરિણામો માટે કાર્ય કરું છું.",
    "b3": "કોડિંગ ઉપરાંત, મને મુસાફરી કરવી, વાંચવું અને ટેકનીકલ દુનિયામાં આગળ રહેવા માટે નવી ટેક્નોલોજી શીખવી ગમે છે.",
    "b4": "—મારું કાર્ય જુઓ અને મારો સંપર્ક કરો!"
  },
  "technologies-known-title": "આવડતી ટેક્નોલોજી",
  "view-all-tech-btn": "બધી ટેક્નોલોજી જુઓ",
  "projects-title": "પ્રોજેક્ટ્સ",
  "add-details-title1": "મારી વધારાની",
  "add-details-title2": "માહિતી",
  "add-detail-breif": "હું અંગ્રેજી, હિન્દી અને ગુજરાતી ભાષાઓ બોલી શકું છું, જે મને વિવિધ લોકોને જોડાવા માટે સક્ષમ બનાવે છે. હું નવી ટેક્નોલોજી શીખવા, નવી અનુભૂતિ માટે પ્રવાસ કરવા અને મારા જ્ઞાનને વિસ્તૃત કરવા માટે વાંચવામાં રસ રાખું છું. મારી અસરકારક સંચાર, તર્કશક્તિ અને નિર્ણય લેવાની ક્ષમતા મને પડકારોને હલ કરવામાં અને ઝડપી રીતે અનુકૂળ થવામાં મદદ કરે છે.",
  "language-title": "આવડતી ભાષાઓ",
  "language": ["અંગ્રેજી", "હિન્દી", "ગુજરાતી"],
  "interest-title": "રુચિ",
  "interest": ["સતત શીખવાનું", "પ્રવાસ", "પુસ્તકો વાંચવું"],
  "softskill-title": "સોફ્ટ સ્કિલ્સ",
  "softskill": [
    "સંચાર કૌશલ્ય",
    "આલોચનાત્મક વિચારસરણી",
    "નિર્ણય લેવા ની ક્ષમતા"
  ],
  "contact-title1": "સંપર્ક",
  "contact-title2": "કરો",
  "contact": {
    "c1": "નામ",
    "c2": "ઇમેઇલ સરનામું",
    "c3": "સંદેશ"
  },
  "send-btn": "મોકલો",
  "contact-success-msg": "મારો સંપર્ક કરવા માટે તમારું આભાર. હું થોડા સમયમાં તમારાથી સંપર્ક કરીશ.",
  "contact-error-msg": "કાંઈક ખોટું થયું છે. કૃપા કરીને થોડીવાર પછી ફરી પ્રયત્ન કરો અથવા ઈમેઇલ કે લિંકડઈન મારફતે સંપર્ક કરો.",

  "follow-me": "મને ફોલો કરો",
  "footer-about-title": "મારા વિશે",
  "footer-about": "ઉત્સાહી ડેવલપર જે ક્રિએટિવ વેબ અનુભવ બનાવે છે. ચાલો મળીએ અને કંઈક શાનદાર બનાવીએ!",
  "check-git": "GitHub પર જુઓ",
  "read-more-bnt": "વધુ વાંચો",
  "tech-used-title": "ઉપયોગમાં લેવાયેલી ટેકનોલોજી",
  "unsupport-vid-tag-warning": "તમારું બ્રાઉઝર વિડીયો ટેગને સપોર્ટ કરતું નથી.",
  "visit-website": "વેબસાઈટ પર જાઓ",
  "proj-images-title": "છબીઓ",
  "pd-proj-p1": "પ્રોજેક્ટની",
  "pd-proj-p2": "અન્ય",
  "pd-proj-p3": "માહિતી",
  "thank-you": "આભાર",
  "project-list": {
    "ProjectsList": [
      {
        "name": "પાથ પ્રોવાઈડર",
        "brief": "આ વેબ એપ્લિકેશન યુનિવર્સિટી અથવા અન્ય જગ્યાના નજીકના સ્થળોને દર્શાવે છે. વપરાશકર્તાઓ ક્યુઆર કોડ સ્કેન કરીને સાઇટ પર ઍક્સેસ મેળવી શકે છે, નકશાઓ જોઈ શકે છે અને સ્થળોની વિગતો શોધી શકે છે.",
        "detail_decs": "આ પ્રોજેક્ટ એક વેબ એપ્લિકેશન છે જે વપરાશકર્તાઓને કોઈ ચોક્કસ યુનિવર્સિટી અથવા અન્ય કોઈ જગ્યાના નજીકના તમામ સ્થળો દર્શાવતા નકશા પ્રદાન કરે છે. વપરાશકર્તાઓ ક્યુઆર કોડ સ્કેન કરીને વેબસાઇટ પર જઈ શકે છે, જ્યાં તેઓ નકશા અને અન્ય વિગતો જોઈ શકે છે. એપ્લિકેશન HTML, CSS, JavaScript અને Python નો ઉપયોગ કરીને બનાવવામાં આવી છે. Python માં Folium લાઈબ્રેરી ઈન્ટરએક્ટિવ નકશા બનાવવા માટે ઉપયોગમાં લેવામાં આવી છે.",
        "technology": ["HTML", "CSS", "JavaScript", "Python", "Folium"],
        "features": [
          "ચોક્કસ જગ્યાના નજીકના સ્થળો સાથે ડાયનામિક નકશા દર્શાવો.",
          "જગ્યા અને યુનિવર્સિટીઓ માટે શોધ કરો.",
          "ઈન્ટરએક્ટિવ અને વપરાશકર્તા-મૈત્રીપૂર્ણ ઈન્ટરફેસ.",
          "પ્રતિસાદી ડિઝાઇન.",
          "ક્યુઆર કોડ સ્કેન કરીને નકશા પર નેવિગેટ કરો."
        ]
      },
      {
        "name": "જાવાસ્ક્રિપ્ટ પ્રોજેક્ટ્સ",
        "brief": "જાવાસ્ક્રિપ્ટ મિની-પ્રોજેક્ટ્સમાં નાના વ્યવહારુ પ્રોજેક્ટ્સ શામેલ છે, જેમ કે એકલ ખેલાડી (મિનિમેક્સ એલ્ગોરિધમ) અને મલ્ટીપ્લેયર ફીચર સાથેનું ટિક-ટૅક-ટો ગેમ, ટુ-ડૂ લિસ્ટ, રેન્ડમ કલર જનરેટર, ટેક્સ્ટ કન્વર્ટર, ટેક્સ્ટ ટુ સ્પીચ કન્વર્ટર, ટેક્સ્ટ શોધ અને હાઇલાઇટિંગ અને હવામાન આગાહી. આ પ્રોજેક્ટ્સ મને કોર જાવાસ્ક્રિપ્ટ, DOM મેનિપ્યુલેશન અને APIsનો અભ્યાસ કરવા માટે અને ઉપયોગી, હેન્ડ્સ-ઓન એપ્લિકેશન્સ બનાવવા માટે સહાય કરે છે.",
        "detail_decs": "મારા જાવાસ્ક્રિપ્ટ કૌશલ્યને સુધારવા માટે મેં મિની-પ્રોજેક્ટ્સનો એક સંગ્રહ બનાવ્યો છે, જેમાં કોર જાવાસ્ક્રિપ્ટ, DOM મેનિપ્યુલેશન, એલ્ગોરિધમ અને API ઈન્ટિગ્રેશનનો સમાવેશ થાય છે. આ સંગ્રહમાં ટિક-ટૅક-ટો ગેમ શામેલ છે, જેમાં એકલ ખેલાડી મોડમાં AI પ્રતિદ્વંદી મિનિમેક્સ એલ્ગોરિધમ દ્વારા સંચાલિત છે, અને બે યુઝર્સ માટે મલ્ટીપ્લેયર મોડ પણ ઉપલબ્ધ છે. મેં એક ટુ-ડૂ લિસ્ટ એપ્લિકેશન પણ વિકસાવી છે, જે વપરાશકર્તાઓને ટાસ્ક્સ ઉમેરવા, સંપાદિત કરવા, પૂર્ણ કરવા અને કાઢી નાખવાની મંજૂરી આપે છે, અને ડેટા સ્થિરતા માટે localStorage નો ઉપયોગ કરે છે. બીજો પ્રોજેક્ટ રેન્ડમ કલર જનરેટર છે, જે ડિઝાઇનર્સ અને ડેવલપર્સ માટે ઉપયોગી HEX અને RGB મૂલ્યો સાથે રેન્ડમ રંગો બનાવે છે. વધારામાં, મેં એક ટેક્સ્ટ કન્વર્ટર વિકસાવ્યું છે, જે વપરાશકર્તાઓને ટેક્સ્ટને-uppercase, lowercase અથવા સેન્ટન્સ કેસમાં કન્વર્ટ કરવાની મંજૂરી આપે છે, જે ટેક્સ્ટ સંપાદનને વધુ અસરકારક બનાવે છે. મારા ટેક્સ્ટ-ટુ-સ્પીચ કન્વર્ટર Web Speech API નો ઉપયોગ કરીને લખાયેલ ટેક્સ્ટને બોલવામાં રૂપાંતરિત કરે છે, જે સુલભતાને વધારો આપે છે. મેં એક ટેક્સ્ટ શોધ અને હાઇલાઇટિંગ સાધન પણ બનાવ્યું છે, જે વપરાશકર્તાઓને પેરાગ્રાફમાં ચોક્કસ શબ્દો શોધવાની અને તેમને તરત હાઇલાઇટ કરવાની મંજૂરી આપે છે. આ પ્રોજેક્ટ્સ મારું જાવાસ્ક્રિપ્ટ નોલેજ, DOM મેનિપ્યુલેશન, ઈવેન્ટ હેન્ડલિંગ, અસિંક્રોનસ પ્રોગ્રામિંગ, એલ્ગોરિધમ અમલ, API ઈન્ટિગ્રેશન અને localStorage માટે ડેટા સ્થિરતાનું જ્ઞાન વધારવામાં મારી મદદ કરે છે. આ પ્રોજેક્ટ્સે મને ન માત્ર મારા જાવાસ્ક્રિપ્ટ કૌશલ્ય મજબૂત બનાવવામાં સહાય કરી છે, પણ વાસ્તવિક વિશ્વની સમસ્યાઓ ઉકેલવા માટે વ્યવહારુ, ઇન્ટરેક્ટિવ એપ્લિકેશન્સ બનાવવાનો હેન્ડ્સ-ઓન અનુભવ પણ આપ્યો છે.",
        "technology": ["JavaScript", "html", "css"],
        "features": [
          "ટિક-ટૅક-ટો (સિંગલ અને મલ્ટીપ્લેયર): AI (મિનિમેક્સ એલ્ગોરિધમ) સામે રમો અથવા મિત્રને ચેલેન્જ કરો.",
          "ટુ-ડૂ લિસ્ટ: ટાસ્ક્સ ઉમેરો, સંપાદિત કરો, પૂર્ણ કરો અને localStorage દ્વારા ડેટા સ્થિરતાને જાળવો.",
          "રેન્ડમ કલર જનરેટર: ડિઝાઇન પ્રેરણાસ્રોત માટે તરત HEX અને RGB રંગો જનરેટ કરો.",
          "ટેક્સ્ટ કન્વર્ટર: ટેક્સ્ટને-uppercase, lowercase, સેન્ટન્સ કેસ વગેરેમાં રૂપાંતરિત કરો.",
          "ટેક્સ્ટ-ટુ-સ્પીચ કન્વર્ટર: લખાયેલ ટેક્સ્ટને બોલવામાં રૂપાંતરિત કરવા માટે Web Speech API નો ઉપયોગ કરે છે.",
          "ટેક્સ્ટ શોધ અને હાઇલાઇટિંગ: પેરાગ્રાફમાં શબ્દો શોધો અને તરત જ હાઇલાઇટ કરો."
        ]
      },
      {
        "name": "ફેસિયલ એક્સપ્રેશન ડિટેક્શન",
        "brief": "પાઈથન, OpenCV, Keras, અને TensorFlow નો ઉપયોગ કરીને બનાવાયેલ ફેસ એક્સપ્રેશન ડિટેક્શન સિસ્ટમ. આ સિસ્ટમ રિયલ-ટાઈમમાં ચહેરાના હાવભાવ ઓળખી અને વર્ગીકૃત કરી શકે છે.",
        "detail_decs": "મેં પાઈથન, OpenCV, Keras, અને TensorFlow નો ઉપયોગ કરીને ફેસ એક્સપ્રેશન ડિટેક્શન સિસ્ટમ વિકસાવી છે, જે રિયલ-ટાઈમમાં ચહેરાના હાવભાવ ઓળખવા અને વર્ગીકૃત કરવા માટે બનાવવામાં આવી છે. આ સિસ્ટમ OpenCV નો ઉપયોગ ચહેરાની શોધ માટે કરે છે, જ્યારે Keras અને TensorFlow ડીપ લર્નિંગ મોડલને શક્તિ આપે છે, જે ખુશ, દુઃખી, ગુસ્સે, આશ્ચર્યચકિત, ન્યુટ્રલ અને અન્ય હાવભાવોને ઓળખી શકે છે. મોડલ ચહેરાના હાવભાવના ડેટાસેટ પર તાલીમ મેળવ્યું છે, જે રિયલ-વર્લ્ડ પરિસ્થિતિઓમાં ઉચ્ચ ચોકસાઈ સુનિશ્ચિત કરે છે. સિસ્ટમ લાઈવ વેબકૅમ ફીડ પ્રોસેસ કરે છે, ચહેરાને શોધે છે, અને તરત જ હાવભાવ વર્ગીકૃત કરે છે, જે માનવ-કમ્પ્યુટર ક્રિયાપ્રતિક્રિયા, ભાવનાત્મક વિશ્લેષણ અને સર્વેલન્સ સિસ્ટમ્સ માટે ઉપયોગી સાબિત થાય છે. ડીપ લર્નિંગ અને કમ્પ્યુટર વિઝનનો લાભ લઈને, આ પ્રોજેક્ટ ઈમેજ પ્રોસેસિંગ, ન્યૂરલ નેટવર્ક્સ અને રિયલ-ટાઈમ AI એપ્લિકેશન્સમાં મારી કુશળતા વધારો કરે છે.",
        "technology": ["python"],
        "features": [
          " રિયલ-ટાઈમ ફેસ ડિટેક્શન",
          " ભાવના વર્ગીકરણ",
          "ડીપ લર્નિંગ મોડલ",
          " લાઈવ વેબકૅમ ઇન્ટિગ્રેશન",
          "સ્કેલેબલ અને કસ્ટમાઇઝેબલ",
          "સંભવિત એપ્લિકેશન્સ: માનવ-કમ્પ્યુટર ક્રિયાપ્રતિક્રિયા, ભાવનાત્મક વિશ્લેષણ અને AI-ચલિત સર્વેલન્સ માટે ઉપયોગી."
        ]
      },
      {
        "name": "ઑથગાર્ડ કોર",

        "brief": "આ પ્રોજેક્ટ ASP.NET Core MVC માં ઓથન્ટિકેશન અને ઓથરાઈઝેશનનું પ્રદર્શન કરે છે, ASP.NET Identity Framework અથવા Entity Framework નો ઉપયોગ કર્યા વિના. હેતુ એ છે કે વપરાશકર્તાના રોલ્સ, ક્લેમ્સ અને પરવાનગીઓને સંચાલિત કરવા માટે કસ્ટમ અમલવારી પ્રદાન કરવી.",

        "detail_decs": "આ પ્રોજેક્ટ ASP.NET Core MVC માં એક કસ્ટમ ઓથન્ટિકેશન અને ઓથરાઈઝેશન સિસ્ટમનું પ્રદર્શન કરે છે, જે ASP.NET Identity Framework અથવા Entity Framework વિના સંપૂર્ણપણે બનાવવામાં આવ્યું છે. બિલ્ટ-ઈન ફ્રેમવર્ક્સ પર આધાર રાખવાને બદલે, તે એક હલકું અને લવચીક વપરાશકર્તા સંચાલન ઉકેલ પ્રદાન કરે છે, જે વપરાશકર્તા ઓથન્ટિકેશન, રોલ્સ, ક્લેમ્સ અને પરવાનગીઓને સંચાલિત કરે છે. સિસ્ટમ સુરક્ષિત રીતે વપરાશકર્તા લોગિન્સ સંચાલિત કરે છે, ચોક્કસ પરવાનગીઓ સાથે રોલ્સ નિમણૂક કરે છે અને મિડલવેર આધારિત ઓથરાઈઝેશન અને ક્લેમ્સ-આધારિત ઓળખ સંચાલન દ્વારા ઍક્સેસ નિયંત્રણ અમલમાં મૂકે છે. તે સુરક્ષિત પાસવર્ડ હેશિંગ અને સોલ્ટિંગ પણ ફીચર કરે છે, જે મજબૂત ઓથન્ટિકેશન સુરક્ષા સુનિશ્ચિત કરે છે. કસ્ટમ ડેટાબેઝ ઉકેલને સમાવીને, આ પ્રોજેક્ટ વપરાશકર્તા ડેટાને કેવી રીતે સંગ્રહિત અને સંચાલિત કરવું તે સંપૂર્ણ નિયંત્રણ આપે છે, જે તેને વિવિધ જરૂરિયાતો માટે અનુરૂપ બનાવે છે.",
        "technology": ["Asp.net core MVC", "HTML", "CSS", "JavaScript"],
        "features": [
          "કસ્ટમ ઓથન્ટિકેશન સિસ્ટમ",
          " રોલ-આધારિત ઍક્સેસ કંટ્રોલ (RBAC)",
          "ક્લેમ્સ-આધારિત ઓથરાઈઝેશન",
          "સુરક્ષિત પાસવર્ડ સ્ટોરેજ",
          " મિડલવેર-આધારિત ઓથરાઈઝેશન",
          "ડેટાબેઝ લવચીકતા"
        ]
      },
      {
        "name": "ક્રોમ એક્સટેન્શન",

        "brief": "એક ક્રોમ એક્સટેન્શન એ બ્રાઉઝરની કાર્યક્ષમતા વિસ્તૃત કરવા માટેનું એક સાધન છે, જે HTML, CSS અને JavaScript જેવી વેબ ટેકનોલોજીનો ઉપયોગ કરીને બનાવવામાં આવે છે. ઉદાહરણ તરીકે, એક કલર પીકર એક્સટેન્શન વપરાશકર્તાઓને વેબ પેજમાંથી રંગો પસંદ કરવાની અને તેમનાં કોડ્સ, જેમ કે HEX, જોવા માટે સક્ષમ બનાવે છે, જે ડિઝાઇન અથવા વિકાસ કાર્યો માટે સરળ બને છે.",

        "detail_decs": "મેં એક Chrome Extension વિકસાવ્યું છે જે HTML, CSS અને JavaScript નો ઉપયોગ કરીને બ્રાઉઝરની કાર્યક્ષમતા વધારશે. ઉદાહરણ તરીકે, Color Picker Extension વપરાશકર્તાઓને કોઈપણ વેબ પેજમાંથી સરળતાથી રંગો પસંદ કરવાની અને તરત જ તેમના HEX, RGB અથવા HSL કોડ્સ જોવા માટે સક્ષમ બનાવે છે. આ ટૂલ ખાસ કરીને ડિઝાઇનર્સ, ડેવલપર્સ અને કન્ટેન્ટ ક્રિએટર્સ માટે ઉપયોગી છે, જેનાથી તેઓ બાહ્ય સોફ્ટવેરની જરૂરિયાત વિના રંગો એક્સ્ટ્રાક્ટ અને ઉપયોગ કરી શકે. એક્સટેન્શન બ્રાઉઝર સાથે સરળતાથી સમાયોજિત થાય છે અને રંગો પસંદ કરવા અને કોપી કરવાની એક સરળ પરંતુ શક્તિશાળી UI પ્રદાન કરે છે. Chrome ના Extension APIs નો ઉપયોગ કરીને, તે વેબ પેજીસ સાથે સુગમ ક્રિયાપ્રતિક્રિયા સુનિશ્ચિત કરે છે, જે રંગ પસંદગીની પ્રક્રિયાને ઝડપી અને કાર્યક્ષમ બનાવે છે.",
        "technology": ["HTML", "CSS", "Javascript"],
        "features": [
          " સરળ રંગ પસંદગી",
          "રંગ કોડ દર્શાવે છે",
          "સિમલેસ ઇન્ટિગ્રેશન",
          "હલકું અને ઝડપી",
          "વપરાશકર્તા-મૈત્રીપૂર્ણ ઇન્ટરફેસ",
          "ડિઝાઇનર્સ અને ડેવલપર્સ માટે આદર્શ"
        ]
      }
    ]
  }
}
